; ModuleID = 'angle.c'
source_filename = "angle.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@state = dso_local global i32 0, align 4, !dbg !0
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [26 x i8] c"Usage: %s [input answer]\0A\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"angle.in\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"angle.ans\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.4 = private unnamed_addr constant [42 x i8] c"%s: length mismatch on line %d: %d vs %d\0A\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"%f\0A\00", align 1
@.str.6 = private unnamed_addr constant [42 x i8] c"%s: expected ';' on line %d, got %c (%u)\0A\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @main(i32, i8**) #0 !dbg !16 {
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  %5 = alloca i8**, align 8
  %6 = alloca i8*, align 8
  %7 = alloca i8*, align 8
  %8 = alloca %struct._IO_FILE*, align 8
  %9 = alloca %struct._IO_FILE*, align 8
  %10 = alloca i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "state", scope: !2, file: !3, line: 15, type: !5, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (https://github.com/llvm/llvm-project.git d0156256e2c22f8d7768400375ae6e3d3f1bf5e1)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !11, nameTableKind: None)
!3 = !DIFile(filename: "angle.c", directory: "/home/eli/sproj-git/blas")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "State", file: !3, line: 15, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "ST_A", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "ST_B", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ST_SEP", value: 2, isUnsigned: true)
!11 = !{!0}
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{i32 1, !"wchar_size", i32 4}
!15 = !{!"clang version 9.0.0 (https://github.com/llvm/llvm-project.git d0156256e2c22f8d7768400375ae6e3d3f1bf5e1)"}
!16 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 17, type: !17, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !23)
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !19, !20}
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{}
!24 = !DILocalVariable(name: "argc", arg: 1, scope: !16, file: !3, line: 17, type: !19)
!25 = !DILocation(line: 17, column: 14, scope: !16)
!26 = !DILocalVariable(name: "argv", arg: 2, scope: !16, file: !3, line: 17, type: !20)
!27 = !DILocation(line: 17, column: 28, scope: !16)
!28 = !DILocation(line: 19, column: 7, scope: !29)
!29 = distinct !DILexicalBlock(scope: !16, file: !3, line: 19, column: 7)
!30 = !DILocation(line: 19, column: 12, scope: !29)
!31 = !DILocation(line: 19, column: 17, scope: !29)
!32 = !DILocation(line: 19, column: 20, scope: !29)
!33 = !DILocation(line: 19, column: 25, scope: !29)
!34 = !DILocation(line: 19, column: 7, scope: !16)
!35 = !DILocation(line: 20, column: 5, scope: !36)
!36 = distinct !DILexicalBlock(scope: !29, file: !3, line: 19, column: 30)
!37 = !DILocalVariable(name: "infn", scope: !16, file: !3, line: 24, type: !21)
!38 = !DILocation(line: 24, column: 10, scope: !16)
!39 = !DILocalVariable(name: "ansfn", scope: !16, file: !3, line: 25, type: !21)
!40 = !DILocation(line: 25, column: 10, scope: !16)
!41 = !DILocation(line: 26, column: 7, scope: !42)
!42 = distinct !DILexicalBlock(scope: !16, file: !3, line: 26, column: 7)
!43 = !DILocation(line: 26, column: 12, scope: !42)
!44 = !DILocation(line: 26, column: 7, scope: !16)
!45 = !DILocation(line: 27, column: 12, scope: !46)
!46 = distinct !DILexicalBlock(scope: !42, file: !3, line: 26, column: 18)
!47 = !DILocation(line: 27, column: 10, scope: !46)
!48 = !DILocation(line: 28, column: 13, scope: !46)
!49 = !DILocation(line: 28, column: 11, scope: !46)
!50 = !DILocation(line: 29, column: 3, scope: !46)
!51 = !DILocalVariable(name: "in", scope: !16, file: !3, line: 31, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !54, line: 48, baseType: !55)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 241, size: 1728, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !85, !87, !89, !93, !96, !98, !100, !101, !102, !103, !107, !108}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 242, baseType: !19, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 247, baseType: !21, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 248, baseType: !21, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 249, baseType: !21, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 250, baseType: !21, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 251, baseType: !21, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 252, baseType: !21, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 253, baseType: !21, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 254, baseType: !21, size: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 256, baseType: !21, size: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 257, baseType: !21, size: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 258, baseType: !21, size: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 260, baseType: !71, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 156, size: 192, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !56, line: 157, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !56, line: 158, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !56, line: 162, baseType: !19, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 262, baseType: !76, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 264, baseType: !19, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 268, baseType: !19, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 270, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 131, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 274, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 275, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 276, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 280, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 150, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 289, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 132, baseType: !84)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 297, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 298, baseType: !99, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !55, file: !56, line: 299, baseType: !99, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !55, file: !56, line: 300, baseType: !99, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 302, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 62, baseType: !106)
!105 = !DIFile(filename: "llvm/lib/clang/9.0.0/include/stddef.h", directory: "/home/eli")
!106 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 303, baseType: !19, size: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 305, baseType: !109, size: 160, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DILocation(line: 31, column: 10, scope: !16)
!113 = !DILocation(line: 31, column: 21, scope: !16)
!114 = !DILocation(line: 31, column: 15, scope: !16)
!115 = !DILocation(line: 32, column: 8, scope: !116)
!116 = distinct !DILexicalBlock(scope: !16, file: !3, line: 32, column: 7)
!117 = !DILocation(line: 32, column: 7, scope: !16)
!118 = !DILocation(line: 32, column: 12, scope: !116)
!119 = !DILocalVariable(name: "ans", scope: !16, file: !3, line: 33, type: !52)
!120 = !DILocation(line: 33, column: 10, scope: !16)
!121 = !DILocation(line: 33, column: 22, scope: !16)
!122 = !DILocation(line: 33, column: 16, scope: !16)
!123 = !DILocation(line: 34, column: 8, scope: !124)
!124 = distinct !DILexicalBlock(scope: !16, file: !3, line: 34, column: 7)
!125 = !DILocation(line: 34, column: 7, scope: !16)
!126 = !DILocation(line: 34, column: 13, scope: !124)
!127 = !DILocalVariable(name: "line_num", scope: !16, file: !3, line: 36, type: !19)
!128 = !DILocation(line: 36, column: 7, scope: !16)
!129 = !DILocalVariable(name: "in_line", scope: !16, file: !3, line: 37, type: !21)
!130 = !DILocation(line: 37, column: 10, scope: !16)
!131 = !DILocalVariable(name: "line_tmp", scope: !16, file: !3, line: 37, type: !21)
!132 = !DILocation(line: 37, column: 28, scope: !16)
!133 = !DILocalVariable(name: "in_pos", scope: !16, file: !3, line: 38, type: !104)
!134 = !DILocation(line: 38, column: 10, scope: !16)
!135 = !DILocalVariable(name: "end", scope: !16, file: !3, line: 39, type: !21)
!136 = !DILocation(line: 39, column: 10, scope: !16)
!137 = !DILocalVariable(name: "n_A", scope: !16, file: !3, line: 40, type: !19)
!138 = !DILocation(line: 40, column: 7, scope: !16)
!139 = !DILocalVariable(name: "n", scope: !16, file: !3, line: 41, type: !19)
!140 = !DILocation(line: 41, column: 7, scope: !16)
!141 = !DILocalVariable(name: "x", scope: !16, file: !3, line: 42, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DILocation(line: 42, column: 12, scope: !16)
!145 = !DILocalVariable(name: "A", scope: !16, file: !3, line: 44, type: !142)
!146 = !DILocation(line: 44, column: 12, scope: !16)
!147 = !DILocation(line: 44, column: 16, scope: !16)
!148 = !DILocalVariable(name: "B", scope: !16, file: !3, line: 45, type: !142)
!149 = !DILocation(line: 45, column: 12, scope: !16)
!150 = !DILocation(line: 45, column: 16, scope: !16)
!151 = !DILocalVariable(name: "max_len", scope: !16, file: !3, line: 46, type: !19)
!152 = !DILocation(line: 46, column: 7, scope: !16)
!153 = !DILocation(line: 48, column: 3, scope: !16)
!154 = !DILocation(line: 48, column: 37, scope: !16)
!155 = !DILocation(line: 48, column: 10, scope: !16)
!156 = !DILocation(line: 48, column: 41, scope: !16)
!157 = !DILocation(line: 49, column: 13, scope: !158)
!158 = distinct !DILexicalBlock(scope: !16, file: !3, line: 48, column: 46)
!159 = !DILocation(line: 50, column: 16, scope: !158)
!160 = !DILocation(line: 50, column: 14, scope: !158)
!161 = !DILocation(line: 52, column: 9, scope: !162)
!162 = distinct !DILexicalBlock(scope: !158, file: !3, line: 52, column: 9)
!163 = !DILocation(line: 52, column: 15, scope: !162)
!164 = !DILocation(line: 52, column: 9, scope: !158)
!165 = !DILocation(line: 53, column: 11, scope: !166)
!166 = distinct !DILexicalBlock(scope: !162, file: !3, line: 52, column: 24)
!167 = !DILocation(line: 53, column: 9, scope: !166)
!168 = !DILocation(line: 54, column: 13, scope: !166)
!169 = !DILocation(line: 55, column: 5, scope: !166)
!170 = !DILocation(line: 55, column: 16, scope: !171)
!171 = distinct !DILexicalBlock(scope: !162, file: !3, line: 55, column: 16)
!172 = !DILocation(line: 55, column: 22, scope: !171)
